modules/ome-web.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Oh My Emacs Web</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Oh My Emacs Web"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-30T17:03+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Oh My Emacs Web</h1>

<p>This is part of the <a href="https://github.com/xiaohanyu/oh-my-emacs">oh-my-emacs</a>.
</p>
<p>
This module contains some packages for web development in Emacs.
</p>
<p>
Web development is really a huge topic. There're dozens of <a href="http://en.wikipedia.org/wiki/Web_template_system">web template systems</a>, hundreds of <a href="http://en.wikipedia.org/wiki/Web_application_framework">web frameworks</a>, different ways, different standards, which
makes it a dirty work to support web development in Emacs. For serious work, I
recommand <a href="http://www.jetbrains.com/webstorm/">WebStorm</a> from <a href="http://www.jetbrains.com/">JetBrains</a>. "Hmm, you're a traitor of Emacs", you may
say. Actually, that depends. I prefer proper tools for proper works. Emacs is
not a one-for-all solution. For example, webstorm has really great semantic
completion for JavaScript, together with a deep <a href="http://www.jetbrains.com/webstorm/features/index.html">understanding</a> of web standards,
and tricks such as incompatibilies between different browsers. As we all know,
the browser compatilibity is one of the biggest nightmares of modern software
engineer, so it's hard for Emacs, an editor, to compete with WebStorm.
</p>
<p>
Ah, seems I'm a salesman from JetBrains. That's not bad. So why I still use
Emacs, at least some times? Actually, for small project, I still prefer Emacs
over huge IDEs, there're several reasons:
</p><ul>
<li>Though Emacs with packages(such as oh-my-emacs) may be slower than vim, it is
  still faster than Java based IDEs.
</li>
<li>Though you lost some great features provide by modern IDE, you have all Emacs
  goodies at your fingertips. For example, you can switch buffers quickly, view
  man pages as you like, view info document for GNU software, fire up eshell to
  do some dirty work quickly.
</li>
<li>You do not need to create workspace, create project in advance when you just
  want to create some tiny test file.
</li>
</ul>


<p>
Enough, now it's the time to see what Emacs provides for you to do basic web
development.
</p></div>

</body>
</html>
